# Base taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Desktop
cask "font-hack"
cask "font-jetbrains-mono"
cask "spectacle"

# Shell/integrations
tap "getantibody/tap"
brew "antibody"
brew "direnv"
brew "doitlive"
brew "fzf"
cask "iterm2"
brew "ripgrep"
brew "rlwrap"
brew "screen"
brew "shellcheck"
brew "starship"
brew "tmux"

# gnupg/passwords
brew "gnupg"
brew "hopenpgp-tools"
cask "keepassx"
brew "pinentry-mac"
brew "ykman"
brew "yubico-piv-tool"

# VCS
brew "diffutils"
brew "git"
brew "mercurial"
cask "meld"
brew "pre-commit"
brew "talisman"

# Dev utils
brew "automake"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "make"
brew "jq"
brew "p7zip"
brew "watch"

# Hashicorp and related
brew "consul"
brew "terraform"
brew "terraform-docs"
brew "tflint"
brew "vault"
cask "vagrant"

# Elixir
brew "elixir"

# Go
brew "go"
brew "gox"
brew "protobuf"

# Java and related
brew "openjdk"
brew "gradle"
brew "groovy"
brew "maven"

# Python
brew "python"
brew "pipenv"

# Nodejs
brew "node"

# Publishing
brew "hugo"
tap "sass/sass"
brew "sass/sass/sass"

# Graphics/video
cask "gimp"
cask "macsvg"
cask "obs"

# Virtualisation
cask "intel-haxm"
cask "virtualbox"
cask "virtualbox-extension-pack"

# Networking
brew "nmap"
cask "bloomrpc"
cask "deluge"
cask "postman"
brew "telnet"
cask "wireshark"
brew "termshark"

# Cloud SDKs
cask "google-cloud-sdk"
brew "awscli"
brew "azure-cli"

# Container/k8s
cask "docker"
brew "minikube"
brew "hadolint"
brew "istioctl"
brew "kubebuilder"
brew "kubectx"
brew "skaffold"
brew "stern"
tap "azure/draft"
brew "azure/draft/draft"
tap "ksonnet/tap"
brew "ksonnet/tap/ks"
tap "okteto/cli"
brew "okteto"
tap "solo-io/tap"
brew "solo-io/tap/squashctl"
tap "txn2/tap"
brew "txn2/tap/kubefwd"
tap "wagoodman/dive"
brew "dive"

# Browsers
cask "firefox"
cask "google-chrome"

# Chat/conferencing
cask "slack"
cask "zoomus"

# VS Code - make sure it is installed on Macs as I'm moving off of Emacs :(
cask "visual-studio-code"
