# Personal
# spell-checker: disable

# Base taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Desktop
cask "font-hack"
cask "font-jetbrains-mono"
cask "spectacle"
cask "font-monoid"
cask "font-fira-code"

# Shell/integrations
# Using asdf for python, node, terraform, terraform-docs, ruby, etc
brew "asdf"
brew "doitlive"
brew "fzf"
brew "grep"
cask "iterm2"
brew "ripgrep"
brew "rlwrap"
brew "screen"
brew "shellcheck"
brew "starship"
brew "tmux"

# gnupg/passwords
brew "gnupg"
brew "hopenpgp-tools"
cask "keepassx"
brew "pinentry-mac"
brew "ykman"
brew "yubico-piv-tool"

# VCS
brew "diffutils"
brew "git"
brew "mercurial"
cask "meld"
brew "pre-commit"
brew "talisman"

# Dev utils
brew "automake"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "make"
brew "jq"
brew "p7zip"
brew "watch"
brew "yq"
brew "gnu-tar"

# Hashicorp and related
brew "consul"
brew "tflint"
brew "vault"
cask "vagrant"

# Elixir
brew "elixir"

# Protocol Buffers and gRPC
brew "protobuf"
tap "bufbuild/buf"
brew "buf"
brew "grpcurl"
cask "bloomrpc"

# Go
brew "go"
brew "gox"
brew "golangci-lint"
brew "goreleaser"
tap "tinygo-org/tools"
brew "tinygo"
brew "cosign"
tap "anchore/syft"
brew "syft"

# Java and related
brew "openjdk"
brew "gradle"
brew "groovy"
brew "maven"

# Publishing
brew "hugo"

# Graphics/video
cask "gimp"
cask "macsvg"
cask "obs"

# Networking
brew "nmap"
cask "deluge"
cask "postman"
brew "telnet"
cask "wireshark"
brew "termshark"
brew "ipmitool"
brew "netcat"
brew "cfssl"
brew "httpie"

# Cloud SDKs
cask "google-cloud-sdk"
brew "awscli"
brew "azure-cli"
brew "oauth2l"

# Container/k8s
brew "kubernetes-cli"
brew "helm"
brew "minikube"
brew "hadolint"
brew "istioctl"
brew "kubebuilder"
brew "kubectx"
brew "skaffold"
brew "stern"
tap "azure/draft"
brew "azure/draft/draft"
tap "okteto/cli"
brew "okteto"
tap "solo-io/tap"
brew "solo-io/tap/squashctl"
tap "wagoodman/dive"
brew "dive"
brew "podman"
brew "kustomize"
tap "buildpacks/tap"
brew "buildpacks/tap/pack"
brew "calicoctl"
brew "opa"
brew "cilium-cli"
brew "hyperkit"
brew "docker"
tap "fluxcd/tap"
brew "fluxcd/tap/flux"

# Browsers
cask "firefox"
cask "google-chrome"

# Chat/conferencing
cask "slack"
cask "discord"

# VS Code - make sure it is installed on Macs as I'm moving off of Emacs :(
cask "visual-studio-code"

# RPM and BIG-IP testing on macOS
brew "rpm"
brew "xorriso"

# ESXi & vSphere
brew "govc"

# Text (asciidoc to other)
brew "asciidoctor"
brew "pandoc"
brew "tectonic"

# Flutter/Dart
cask "flutter"

# WASM
brew "wabt"
brew "emscripten"
brew "wasm3"
brew "wasmtime"
brew "wasmer"
brew "binaryen"
