# Personal
# spell-checker: disable

# Base taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Desktop
cask "font-hack"
cask "font-jetbrains-mono"
cask "spectacle"

# Shell/integrations
tap "getantibody/tap"
brew "antibody"
brew "direnv"
brew "doitlive"
brew "fzf"
brew "grep"
cask "iterm2"
brew "ripgrep"
brew "rlwrap"
brew "screen"
brew "shellcheck"
brew "starship"
brew "tmux"

# gnupg/passwords
brew "gnupg"
brew "hopenpgp-tools"
cask "keepassx"
brew "pinentry-mac"
brew "ykman"
brew "yubico-piv-tool"

# VCS
brew "diffutils"
brew "git"
brew "mercurial"
cask "meld"
brew "pre-commit"
brew "talisman"

# Dev utils
brew "automake"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "make"
brew "jq"
brew "p7zip"
brew "watch"
brew "yq"

# Hashicorp and related
brew "consul"
brew "terraform-docs"
brew "tflint"
brew "vault"
cask "vagrant"
brew "tfenv"
brew "packer"

# Elixir
brew "elixir"

# Protocol Buffers and gRPC
brew "protobuf"
tap "bufbuild/buf"
brew "buf"
brew "grpcurl"
cask "bloomrpc"

# Go
brew "go"
brew "gox"
brew "gopls"
brew "golangci-lint"
brew "staticcheck"
brew "delve"
brew "goreleaser"

# Java and related
brew "openjdk"
brew "gradle"
brew "groovy"
brew "maven"

# Python - switch to pyenv for projects and use brew python@ just for linked
# pyenv dependencies
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"
brew "pyenv"
brew "pipenv"

# Nodejs
brew "node"

# Publishing
brew "hugo"

# Graphics/video
cask "gimp"
cask "macsvg"
cask "obs"

# Virtualisation
cask "intel-haxm"
cask "virtualbox"
cask "virtualbox-extension-pack"

# Networking
brew "nmap"
cask "deluge"
cask "postman"
brew "telnet"
cask "wireshark"
brew "termshark"
brew "ipmitool"
brew "netcat"
brew "cfssl"
brew "httpie"

# Cloud SDKs
cask "google-cloud-sdk"
brew "awscli"
brew "azure-cli"

# Container/k8s
cask "docker"
brew "minikube"
brew "hadolint"
brew "istioctl"
brew "kubebuilder"
brew "kubectx"
brew "skaffold"
brew "stern"
tap "azure/draft"
brew "azure/draft/draft"
tap "okteto/cli"
brew "okteto"
tap "solo-io/tap"
brew "solo-io/tap/squashctl"
tap "wagoodman/dive"
brew "dive"
brew "podman"
brew "kustomize"
tap "buildpacks/tap"
brew "buildpacks/tap/pack"
brew "calicoctl"
brew "opa"

# Browsers
cask "firefox"
cask "google-chrome"

# Chat/conferencing
cask "slack"
cask "zoom"
cask "discord"

# VS Code - make sure it is installed on Macs as I'm moving off of Emacs :(
cask "visual-studio-code"

# RPM and BIG-IP testing on macOS
brew "rpm"
brew "xorriso"

# Ruby
brew "rbenv"

# ESXi & vSphere
brew "govc"

# Text (asciidoc to other)
brew "asciidoctor"
brew "pandoc"
brew "tectonic"

# Flutter/Dart
cask "flutter"
