# this block is in alphabetic order
mafredri/zsh-async
MichaelAquilina/zsh-you-should-use
rupa/z
zsh-users/zsh-completions
zsh-users/zsh-autosuggestions

# Theme
geometry-zsh/geometry branch:mnml
memes/geometry-gcloud-account branch:v2

# Load these last!
#zsh-users/zsh-syntax-highlighting
zdharma/fast-syntax-highlighting
zsh-users/zsh-history-substring-search
